; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 1)
	(= (value c1) 25)
	(= (value c2) 5)
	(= (value c3) 38)
	(= (value c4) 91)
	(= (value c5) 12)
	(= (value c6) 11)
	(= (value c7) 73)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 7
2. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 7
3. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 7
4. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 7
5. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 7
6. (increment c6)
   changed: (value c6) from 11 to 13
   goals met: 5 of 7
7. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 5 of 7
8. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 5 of 7
9. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 5 of 7
10. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 5 of 7
11. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 5 of 7
12. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 5 of 7
13. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 5 of 7
14. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 5 of 7
15. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 7
16. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 5 of 7
17. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 5 of 7
18. (increment c2)
   changed: (value c2) from 5 to 10
   goals met: 5 of 7
19. (increment c2)
   changed: (value c2) from 10 to 15
   goals met: 5 of 7
20. (increment c2)
   changed: (value c2) from 15 to 20
   goals met: 5 of 7
21. (increment c2)
   changed: (value c2) from 20 to 25
   goals met: 5 of 7
22. (increment c2)
   changed: (value c2) from 25 to 30
   goals met: 6 of 7
23. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 6 of 7
24. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 6 of 7
25. (increment c5)
   changed: (value c5) from 12 to 21
   goals met: 5 of 7
26. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 5 of 7
27. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 5 of 7
28. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 5 of 7
29. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 5 of 7
30. (increment c5)
   changed: (value c5) from 21 to 30
   goals met: 5 of 7
31. (increment c5)
   changed: (value c5) from 30 to 39
   goals met: 5 of 7
32. (increment c5)
   changed: (value c5) from 39 to 48
   goals met: 5 of 7
33. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 5 of 7
34. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 7
35. (increment c6)
   changed: (value c6) from 13 to 17
   goals met: 5 of 7
36. (increment c6)
   changed: (value c6) from 17 to 21
   goals met: 5 of 7
37. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 5 of 7
38. (increment c6)
   changed: (value c6) from 21 to 26
   goals met: 5 of 7
39. (increment c6)
   changed: (value c6) from 26 to 31
   goals met: 5 of 7
40. (increment c6)
   changed: (value c6) from 31 to 36
   goals met: 5 of 7
41. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 5 of 7
42. (increment c5)
   changed: (value c5) from 48 to 57
   goals met: 5 of 7
43. (decrement c4)
   changed: (value c4) from 91 to 86
   goals met: 5 of 7
44. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 5 of 7
45. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 5 of 7
46. (increment c6)
   changed: (value c6) from 36 to 42
   goals met: 5 of 7
47. (increment c6)
   changed: (value c6) from 42 to 48
   goals met: 5 of 7
48. (increment c6)
   changed: (value c6) from 48 to 54
   goals met: 5 of 7
49. (increment c6)
   changed: (value c6) from 54 to 60
   goals met: 6 of 7
50. (increment c5)
   changed: (value c5) from 57 to 67
   goals met: 5 of 7
51. (decrement c4)
   changed: (value c4) from 86 to 81
   goals met: 5 of 7
52. (increment c6)
   changed: (value c6) from 60 to 66
   goals met: 5 of 7
53. (increment c6)
   changed: (value c6) from 66 to 72
   goals met: 6 of 7
54. (increment c5)
   changed: (value c5) from 67 to 77
   goals met: 5 of 7
55. (increment c6)
   changed: (value c6) from 72 to 78
   goals met: 5 of 7
56. (decrement c4)
   changed: (value c4) from 81 to 76
   goals met: 6 of 7
57. (decrement c6)
   changed: (value c6) from 78 to 72
   goals met: 6 of 7
58. (decrement c5)
   changed: (value c5) from 77 to 67
   goals met: 6 of 7
59. (decrement c4)
   changed: (value c4) from 76 to 71
   goals met: 6 of 7
60. (decrement c4)
   changed: (value c4) from 71 to 66
   goals met: 7 of 7
